ci4/app/Controllers/Artikel.php

public function admin_index()
{
$title = 'Daftar Artikel (Admin)';
$model = new ArtikelModel();
$q = $this->request->getVar('q') ?? '';
$kategori_id = $this->request->getVar('kategori_id') ?? '';
$page = $this->request->getVar('page') ?? 1;
$builder = $model->table('artikel')

->select('artikel.*, kategori.nama_kategori')

->join('kategori', 'kategori.id_kategori =

artikel.id_kategori');
if ($q != '') {
$builder->like('artikel.judul', $q);
}
if ($kategori_id != '') {
$builder->where('artikel.id_kategori', $kategori_id);
}
$artikel = $builder->paginate(10, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` =

`artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` =

`artikel`.`id_kategori`
 LIMIT 10

return $this->response->setJSON($data);
} else {
$kategoriModel = new KategoriModel();
$data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

public function view($slug)
{
$model = new ArtikelModel();
$data['artikel'] = $model->where('slug', $slug)->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-ketiga'
 LIMIT 1